In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("online_retail.csv")
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [3]:
df.shape

(541909, 8)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 33.1+ MB

In [5]:
df['CustomerID'].isnull().sum()

np.int64(135080)

In [6]:
def rend_colonne_minuscule(df):
    df.columns = df.columns.str.lower()
    return df

In [7]:
df = rend_colonne_minuscule(df)
df.head()

,invoiceno,stockcode,description,quantity,invoicedate,unitprice,customerid,country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [8]:
df['customerid'] = df['customerid'].astype(str)

In [9]:
df['customerid'] = df['customerid'].fillna('inconnu')

In [10]:
df.drop(df[df["quantity"]<=0].index,inplace=True)

In [11]:
df.duplicated(['invoiceno', 'stockcode', 'customerid']).sum()

np.int64(10535)

In [12]:
df = df.drop_duplicates(subset=['invoiceno', 'stockcode', 'customerid'])

In [13]:
df['invoicedate'] = pd.to_datetime(df['invoicedate'])

In [14]:
df['year'] = df['invoicedate'].dt.year

df['totalprice'] = df['quantity'] * df['unitprice']

In [15]:
df.head()

,invoiceno,stockcode,description,quantity,invoicedate,unitprice,customerid,country,year,totalprice
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,2010,15.30
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,2010,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,2010,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,2010,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,2010,20.34

In [16]:
df['totalinvoice'] = df.groupby('invoiceno')['totalprice'].transform('sum')

In [17]:
df.head()

,invoiceno,stockcode,description,quantity,invoicedate,unitprice,customerid,country,year,totalprice,totalinvoice
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,2010,15.30,139.12
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,2010,20.34,139.12
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,2010,22.00,139.12
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,2010,20.34,139.12
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,2010,20.34,139.12

# Homework
Travail à faire :
- Chiffre d'affaires par mois, année
- Nombre commande par client 
- Montant total dépensé par client 
- Date de la première et dernière commande par client 
- Délai entre la première et dernière commande

## 1. Chiffre d'affaires par mois et année

In [23]:
df['month'] = df['invoicedate'].dt.month
chiffre_affaire_mensuel = df.groupby(['year', 'month'])['totalinvoice'].sum().reset_index()
chiffre_affaire_mensuel.rename(columns={'totalinvoice': 'chiffre_affaire'}, inplace=True)
chiffre_affaire_mensuel

    year  month  chiffre_affaire
0   2010     12     9.405730e+07
1   2011      1     4.891112e+07
2   2011      2     2.277113e+07
3   2011      3     3.364868e+07
4   2011      4     2.097765e+07
5   2011      5     2.962832e+07
6   2011      6     3.727904e+07
7   2011      7     4.237600e+07
8   2011      8     4.410641e+07
9   2011      9     4.896870e+07
10  2011     10     7.784611e+07
11  2011     11     1.479550e+08
12  2011     12     6.745875e+07

## 2.  Nombre commande par client

In [27]:
nombre_com_client = df.groupby(['customerid'])['quantity'].sum().reset_index()
nombre_com_client.rename(columns={'quantity': 'nombre_commande'}, inplace=True)
nombre_com_client

     customerid  nombre_commande
0       12346.0            74215
1       12347.0             2458
2       12348.0             1861
3       12349.0              631
4       12350.0              197
...         ...              ...
4335    18281.0               54
4336    18282.0              103
4337    18283.0             1299
4338    18287.0             1562
4339        nan           476655

[4340 rows x 2 columns]

## 3. Montant total depensé par client

In [29]:
montant_tot_dep_client = df.groupby(['customerid'])['totalprice'].sum().reset_index()
montant_tot_dep_client.rename(columns={'totalprice': 'montant_total_dep_client'}, inplace=True)
montant_tot_dep_client

     customerid  montant_total_dep_client
0       12346.0                  77183.60
1       12347.0                   4310.00
2       12348.0                   1595.64
3       12349.0                   1757.55
4       12350.0                    334.40
...         ...                       ...
4335    18281.0                     80.82
4336    18282.0                    178.05
4337    18283.0                   1970.28
4338    18287.0                   1797.68
4339        nan                1720400.06

[4340 rows x 2 columns]

## 4. Date de la première et dernière commande par client

In [30]:
date_1ere_com_client = df.groupby(['customerid'])['invoicedate'].min().reset_index()
date_1ere_com_client.rename(columns={'invoicedate': 'date_1ere_com_client'}, inplace=True)
date_1ere_com_client

     customerid date_1ere_com_client
0       12346.0  2011-01-18 10:01:00
1       12347.0  2010-12-07 14:57:00
2       12348.0  2010-12-16 19:09:00
3       12349.0  2011-11-21 09:51:00
4       12350.0  2011-02-02 16:01:00
...         ...                  ...
4335    18281.0  2011-06-12 10:53:00
4336    18282.0  2011-08-05 13:35:00
4337    18283.0  2011-01-06 14:14:00
4338    18287.0  2011-05-22 10:39:00
4339        nan  2010-12-01 11:52:00

[4340 rows x 2 columns]

In [31]:
date_derniere_com_client = df.groupby(['customerid'])['invoicedate'].max().reset_index()
date_derniere_com_client.rename(columns={'invoicedate': 'date_derniere_com_client'}, inplace=True)
date_derniere_com_client

     customerid date_derniere_com_client
0       12346.0      2011-01-18 10:01:00
1       12347.0      2011-12-07 15:52:00
2       12348.0      2011-09-25 13:13:00
3       12349.0      2011-11-21 09:51:00
4       12350.0      2011-02-02 16:01:00
...         ...                      ...
4335    18281.0      2011-06-12 10:53:00
4336    18282.0      2011-12-02 11:43:00
4337    18283.0      2011-12-06 12:02:00
4338    18287.0      2011-10-28 09:29:00
4339        nan      2011-12-09 10:26:00

[4340 rows x 2 columns]

## 5. Délai entre la première et dernière commande

In [32]:
delai_com = pd.merge(date_1ere_com_client, date_derniere_com_client, on='customerid')
delai_com['delai_com'] = delai_com['date_derniere_com_client'] - delai_com['date_1ere_com_client']
delai_com

,customerid,date_1ere_com_client,date_derniere_com_client,delai_com
0,12346.0,2011-01-18 10:01:00,2011-01-18 10:01:00,0 days 00:00:00
1,12347.0,2010-12-07 14:57:00,2011-12-07 15:52:00,365 days 00:55:00
2,12348.0,2010-12-16 19:09:00,2011-09-25 13:13:00,282 days 18:04:00
3,12349.0,2011-11-21 09:51:00,2011-11-21 09:51:00,0 days 00:00:00
4,12350.0,2011-02-02 16:01:00,2011-02-02 16:01:00,0 days 00:00:00
...,...,...,...,...
4335,18281.0,2011-06-12 10:53:00,2011-06-12 10:53:00,0 days 00:00:00
4336,18282.0,2011-08-05 13:35:00,2011-12-02 11:43:00,118 days 22:08:00
4337,18283.0,2011-01-06 14:14:00,2011-12-06 12:02:00,333 days 21:48:00
4338,18287.0,2011-05-22 10:39:00,2011-10-28 09:29:00,158 days 22:50:00
4339,nan,2010-12-01 11:52:00,2011-12-09 10:26:00,372 days 22:34:00